org/Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020
#+TITLE: Regression and Other Stories by Andrew Gelman, Jennifer Hill, and Aki Vehtari in 2020
* keywords: [[file:books.org][books]], [[file:probabilistic_inference.org][probabilistic inference]], [[file:Andrew_Gelman.org][Andrew Gelman]], [[file:Jennifer_Hill.org][Jennifer Hill]], [[file:Aki_Vehtari.org][Aki Vehtari]]
goals: 
* references
** url:: https://avehtari.github.io/ROS-Examples/
** [[file:Aki_Vehtari.org][Aki Vehtari]] on [[file:Bayesian_data_analysis_by_Andrew_Gelman,_Aki_Vehtari,_et_al_in_2014.org][Bayesian data analysis by Andrew Gelman, Aki Vehtari, et al in 2014]] book
*** https://aalto.cloud.panopto.eu/Panopto/Pages/Sessions/List.aspx#folderID=%22f0ec3a25-9e23-4935-873b-a9f401646812%22
* examples
** Compare to those of [[file:Data_analysis_using_regression_and_multilevel_hierarchical_models_by_Andrew_Gelman_and_Jennifer_Hill_in_2006.org][Data analysis using regression and multilevel hierarchical models by Andrew Gelman and Jennifer Hill in 2006]]
** https://github.com/avehtari/ROS-Examples
** alphabetical order
*** [[https://github.com/avehtari/ROS-Examples/tree/master/AcademyAwards/][AcademyAwards/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/AgePeriodCohort/][AgePeriodCohort/]]
**** [[https://avehtari.github.io/ROS-Examples/AgePeriodCohort/births.html][births.html]] * Age adjustment
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Arsenic/][Arsenic/]]
**** [[https://avehtari.github.io/ROS-Examples/Arsenic/arsenic_logistic_building.html][arsenic_logistic_building.html]] * Building a logistic regression model: wells in Bangladesh
**** [[https://avehtari.github.io/ROS-Examples/Arsenic/arsenic_logistic_residuals.html][arsenic_logistic_residuals.html]] * Residual plots for a logistic regression model: wells in Bangladesh
**** [[https://avehtari.github.io/ROS-Examples/Arsenic/arsenic_logistic_apc.html][arsenic_logistic_apc.html]] * Average predictice comparisons for a logistic regression model: wells in Bangladesh
**** [[https://avehtari.github.io/ROS-Examples/Arsenic/arsenic_logistic_building_optimizing.html][arsenic_logistic_building_optimizing.html]] * Building a logistic regression model: wells in Bangladesh. A version with normal approximation at the mode.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Balance/][Balance/]]
**** [[https://avehtari.github.io/ROS-Examples/Balance/treatcontrol.html][treatcontrol.html]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Beauty/][Beauty/]]
**** [[https://avehtari.github.io/ROS-Examples/Beauty/beauty.html][beauty.html]] * Student evaluations of instructors’ beauty and teaching quality
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Bypass/][Bypass/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/CausalDiagram/][CausalDiagram/]]
**** [[https://avehtari.github.io/ROS-Examples/CausalDiagram/diagrams.html][diagrams.html]] * Plot causal diagram
*** [[https://github.com/avehtari/ROS-Examples/tree/master/CentralLimitTheorem/][CentralLimitTheorem/]]
**** [[https://avehtari.github.io/ROS-Examples/CentralLimitTheorem/heightweight.html][heightweight.html]] * Illustrate central limit theorem and normal distribution
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Childcare/][Childcare/]]
**** [[https://avehtari.github.io/ROS-Examples/Childcare/childcare.html) * Infant Health and Development Program (IHDP][childcare.html]] example.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/ChileSchools/][ChileSchools/]]
**** [[https://avehtari.github.io/ROS-Examples/ChileSchools/chile_schools.html][chile_schools.html]] * ChileSchools example.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Coins/][Coins/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Congress/][Congress/]]
**** [[https://avehtari.github.io/ROS-Examples/Congress/congress.html][congress.html]] * Predictive uncertainty for congressional elections
**** [[https://avehtari.github.io/ROS-Examples/Congress/congress_plots.html][congress_plots.html]] * Predictive uncertainty for congressional elections
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Coop/][Coop/]]
**** [[https://avehtari.github.io/ROS-Examples/Coop/riverbay.html][riverbay.html]] * Example of hypothesis testing
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Coverage/][Coverage/]]
**** [[https://avehtari.github.io/ROS-Examples/Coverage/coverage.html][coverage.html]] * Example of coverage
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Cows/][Cows/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/CrossValidation/][CrossValidation/]]
**** [[https://avehtari.github.io/ROS-Examples/CrossValidation/crossvalidation.html][crossvalidation.html]] * Demonstration of cross validation
*** [[https://github.com/avehtari/ROS-Examples/tree/master/SampleSize/][SampleSize/]]
**** [[https://avehtari.github.io/ROS-Examples/DataCollection/simulation.html][simulation.html]] * Sample size simulation
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Death/][Death/]]
**** [[https://avehtari.github.io/ROS-Examples/Death/polls.html][polls.html]] * Proportion of American adults supporting the death penalty
*** [[https://github.com/avehtari/ROS-Examples/tree/master/DifferentSoftware/][DifferentSoftware/]]
**** [[https://avehtari.github.io/ROS-Examples/DifferentSoftware/linear.html][linear.html]] * Linear regression using different software options
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Earnings/][Earnings/]]
**** [[https://avehtari.github.io/ROS-Examples/Earnings/earnings_regression.html][earnings_regression.html]] * Predict respondents’ yearly earnings using survey data from 1990.
**** [[https://avehtari.github.io/ROS-Examples/Earnings/earnings_bootstrap.html][earnings_bootstrap.html]] * Bootstrapping to simulate the sampling distribution
**** [[https://avehtari.github.io/ROS-Examples/Earnings/earnings_compound.html][earnings_compound.html]] * Compound discrete-continuos model
**** [[https://avehtari.github.io/ROS-Examples/Earnings/height_and_weight.html][height_and_weight.html]] * Predict weight
*** [[https://github.com/avehtari/ROS-Examples/tree/master/ElectionsEconomy/][ElectionsEconomy/]]
**** [[https://avehtari.github.io/ROS-Examples/ElectionsEconomy/bayes.html][bayes.html]] * Demonstration of Bayesian information aggregation
**** [[https://avehtari.github.io/ROS-Examples/ElectionsEconomy/hibbs.html][hibbs.html]] * Predicting presidential vote share from the economy
**** [[https://avehtari.github.io/ROS-Examples/ElectionsEconomy/hills.html][hills.html]] * Present uncertainty in parameter estimates
