content/posts/Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020.md
+++
title = "Regression and Other Stories by Andrew Gelman, Jennifer Hill, and Aki Vehtari in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:44-04:00
slug = "Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020"
draft = false
+++

## keywords: [books]({{< relref "books" >}}), [probabilistic inference]({{< relref "probabilistic_inference" >}}), [Andrew Gelman]({{< relref "Andrew_Gelman" >}}), [Jennifer Hill]({{< relref "Jennifer_Hill" >}}), [Aki Vehtari]({{< relref "Aki_Vehtari" >}}) {#keywords-books--books-dot-md--probabilistic-inference--probabilistic-inference-dot-md--andrew-gelman--andrew-gelman-dot-md--jennifer-hill--jennifer-hill-dot-md--aki-vehtari--aki-vehtari-dot-md}

goals:


## references {#references}


### url:: <https://avehtari.github.io/ROS-Examples/> {#url-https-avehtari-dot-github-dot-io-ros-examples}


### [Aki Vehtari]({{< relref "Aki_Vehtari" >}}) on [Bayesian data analysis by Andrew Gelman, Aki Vehtari, et al in 2014]({{< relref "Bayesian_data_analysis_by_Andrew_Gelman,_Aki_Vehtari,_et_al_in_2014" >}}) book {#aki-vehtari--aki-vehtari-dot-md--on-bayesian-data-analysis-by-andrew-gelman-aki-vehtari-et-al-in-2014--bayesian-data-analysis-by-andrew-gelman-aki-vehtari-et-al-in-2014-dot-md--book}

<!--list-separator-->

-  <https://aalto.cloud.panopto.eu/Panopto/Pages/Sessions/List.aspx#folderID=%22f0ec3a25-9e23-4935-873b-a9f401646812%22>


## examples {#examples}


### Compare to those of [Data analysis using regression and multilevel hierarchical models by Andrew Gelman and Jennifer Hill in 2006]({{< relref "Data_analysis_using_regression_and_multilevel_hierarchical_models_by_Andrew_Gelman_and_Jennifer_Hill_in_2006" >}}) {#compare-to-those-of-data-analysis-using-regression-and-multilevel-hierarchical-models-by-andrew-gelman-and-jennifer-hill-in-2006--data-analysis-using-regression-and-multilevel-hierarchical-models-by-andrew-gelman-and-jennifer-hill-in-2006-dot-md}


### <https://github.com/avehtari/ROS-Examples> {#https-github-dot-com-avehtari-ros-examples}


### alphabetical order {#alphabetical-order}

<!--list-separator-->

-  [AcademyAwards/](<https://github.com/avehtari/ROS-Examples/tree/master/AcademyAwards/>)

<!--list-separator-->

-  [AgePeriodCohort/](<https://github.com/avehtari/ROS-Examples/tree/master/AgePeriodCohort/>)

    <!--list-separator-->

    -  [births.html](<https://avehtari.github.io/ROS-Examples/AgePeriodCohort/births.html>) \* Age adjustment

<!--list-separator-->

-  [Arsenic/](<https://github.com/avehtari/ROS-Examples/tree/master/Arsenic/>)

    <!--list-separator-->

    -  [arsenic\_logistic\_building.html](<https://avehtari.github.io/ROS-Examples/Arsenic/arsenic%5Flogistic%5Fbuilding.html>) \* Building a logistic regression model: wells in Bangladesh

    <!--list-separator-->

    -  [arsenic\_logistic\_residuals.html](<https://avehtari.github.io/ROS-Examples/Arsenic/arsenic%5Flogistic%5Fresiduals.html>) \* Residual plots for a logistic regression model: wells in Bangladesh

    <!--list-separator-->

    -  [arsenic\_logistic\_apc.html](<https://avehtari.github.io/ROS-Examples/Arsenic/arsenic%5Flogistic%5Fapc.html>) \* Average predictice comparisons for a logistic regression model: wells in Bangladesh

    <!--list-separator-->

    -  [arsenic\_logistic\_building\_optimizing.html](<https://avehtari.github.io/ROS-Examples/Arsenic/arsenic%5Flogistic%5Fbuilding%5Foptimizing.html>) \* Building a logistic regression model: wells in Bangladesh. A version with normal approximation at the mode.

<!--list-separator-->

-  [Balance/](<https://github.com/avehtari/ROS-Examples/tree/master/Balance/>)

    <!--list-separator-->

    -  [treatcontrol.html](<https://avehtari.github.io/ROS-Examples/Balance/treatcontrol.html>)

<!--list-separator-->

-  [Beauty/](<https://github.com/avehtari/ROS-Examples/tree/master/Beauty/>)

    <!--list-separator-->

    -  [beauty.html](<https://avehtari.github.io/ROS-Examples/Beauty/beauty.html>) \* Student evaluations of instructors’ beauty and teaching quality

<!--list-separator-->

-  [Bypass/](<https://github.com/avehtari/ROS-Examples/tree/master/Bypass/>)

<!--list-separator-->

-  [CausalDiagram/](<https://github.com/avehtari/ROS-Examples/tree/master/CausalDiagram/>)

    <!--list-separator-->

    -  [diagrams.html](<https://avehtari.github.io/ROS-Examples/CausalDiagram/diagrams.html>) \* Plot causal diagram

<!--list-separator-->

-  [CentralLimitTheorem/](<https://github.com/avehtari/ROS-Examples/tree/master/CentralLimitTheorem/>)

    <!--list-separator-->

    -  [heightweight.html](<https://avehtari.github.io/ROS-Examples/CentralLimitTheorem/heightweight.html>) \* Illustrate central limit theorem and normal distribution

<!--list-separator-->

-  [Childcare/](<https://github.com/avehtari/ROS-Examples/tree/master/Childcare/>)

    <!--list-separator-->

    -  [childcare.html](<https://avehtari.github.io/ROS-Examples/Childcare/childcare.html>) \* Infant Health and Development Program (IHDP) example.

<!--list-separator-->

-  [ChileSchools/](<https://github.com/avehtari/ROS-Examples/tree/master/ChileSchools/>)

    <!--list-separator-->

    -  [chile\_schools.html](<https://avehtari.github.io/ROS-Examples/ChileSchools/chile%5Fschools.html>) \* ChileSchools example.

<!--list-separator-->

-  [Coins/](<https://github.com/avehtari/ROS-Examples/tree/master/Coins/>)

<!--list-separator-->

-  [Congress/](<https://github.com/avehtari/ROS-Examples/tree/master/Congress/>)

    <!--list-separator-->

    -  [congress.html](<https://avehtari.github.io/ROS-Examples/Congress/congress.html>) \* Predictive uncertainty for congressional elections

    <!--list-separator-->

    -  [congress\_plots.html](<https://avehtari.github.io/ROS-Examples/Congress/congress%5Fplots.html>) \* Predictive uncertainty for congressional elections

<!--list-separator-->

-  [Coop/](<https://github.com/avehtari/ROS-Examples/tree/master/Coop/>)

    <!--list-separator-->

    -  [riverbay.html](<https://avehtari.github.io/ROS-Examples/Coop/riverbay.html>) \* Example of hypothesis testing

<!--list-separator-->

-  [Coverage/](<https://github.com/avehtari/ROS-Examples/tree/master/Coverage/>)

    <!--list-separator-->

    -  [coverage.html](<https://avehtari.github.io/ROS-Examples/Coverage/coverage.html>) \* Example of coverage

<!--list-separator-->

-  [Cows/](<https://github.com/avehtari/ROS-Examples/tree/master/Cows/>)

<!--list-separator-->

-  [CrossValidation/](<https://github.com/avehtari/ROS-Examples/tree/master/CrossValidation/>)

    <!--list-separator-->

    -  [crossvalidation.html](<https://avehtari.github.io/ROS-Examples/CrossValidation/crossvalidation.html>) \* Demonstration of cross validation

<!--list-separator-->

-  [SampleSize/](<https://github.com/avehtari/ROS-Examples/tree/master/SampleSize/>)

    <!--list-separator-->

    -  [simulation.html](<https://avehtari.github.io/ROS-Examples/DataCollection/simulation.html>) \* Sample size simulation

<!--list-separator-->

-  [Death/](<https://github.com/avehtari/ROS-Examples/tree/master/Death/>)

    <!--list-separator-->

    -  [polls.html](<https://avehtari.github.io/ROS-Examples/Death/polls.html>) \* Proportion of American adults supporting the death penalty

<!--list-separator-->

-  [DifferentSoftware/](<https://github.com/avehtari/ROS-Examples/tree/master/DifferentSoftware/>)

    <!--list-separator-->

    -  [linear.html](<https://avehtari.github.io/ROS-Examples/DifferentSoftware/linear.html>) \* Linear regression using different software options

<!--list-separator-->

-  [Earnings/](<https://github.com/avehtari/ROS-Examples/tree/master/Earnings/>)

    <!--list-separator-->

    -  [earnings\_regression.html](<https://avehtari.github.io/ROS-Examples/Earnings/earnings%5Fregression.html>) \* Predict respondents’ yearly earnings using survey data from 1990.

    <!--list-separator-->

    -  [earnings\_bootstrap.html](<https://avehtari.github.io/ROS-Examples/Earnings/earnings%5Fbootstrap.html>) \* Bootstrapping to simulate the sampling distribution

    <!--list-separator-->

    -  [earnings\_compound.html](<https://avehtari.github.io/ROS-Examples/Earnings/earnings%5Fcompound.html>) \* Compound discrete-continuos model

    <!--list-separator-->

    -  [height\_and\_weight.html](<https://avehtari.github.io/ROS-Examples/Earnings/height%5Fand%5Fweight.html>) \* Predict weight

<!--list-separator-->

-  [ElectionsEconomy/](<https://github.com/avehtari/ROS-Examples/tree/master/ElectionsEconomy/>)

    <!--list-separator-->

    -  [bayes.html](<https://avehtari.github.io/ROS-Examples/ElectionsEconomy/bayes.html>) \* Demonstration of Bayesian information aggregation

    <!--list-separator-->

    -  [hibbs.html](<https://avehtari.github.io/ROS-Examples/ElectionsEconomy/hibbs.html>) \* Predicting presidential vote share from the economy

    <!--list-separator-->

    -  [hills.html](<https://avehtari.github.io/ROS-Examples/ElectionsEconomy/hills.html>) \* Present uncertainty in parameter estimates

    <!--list-separator-->
