org/Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020.org
**** [[https://avehtari.github.io/ROS-Examples/ElectionsEconomy/hibbs_coverage.html][hibbs_coverage.html]] * Checking the model-fitting procedure using fake-data simulation.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/ElectricCompany/][ElectricCompany/]]
**** [[https://avehtari.github.io/ROS-Examples/ElectricCompany/electric.html][electric.html]] * Analysis of “Electric company” data
*** [[https://github.com/avehtari/ROS-Examples/tree/master/FakeKCV/][FakeKCV/]]
**** [[https://avehtari.github.io/ROS-Examples/FakeKCV/fake_kcv.html][fake_kcv.html]] * Demonstration of KK-fold cross-validation using simulated data
*** [[https://github.com/avehtari/ROS-Examples/tree/master/FakeMidtermFinal/][FakeMidtermFinal/]]
**** [[https://avehtari.github.io/ROS-Examples/FakeMidtermFinal/simulation.html][simulation.html]] * Fake dataset of 1000 students’ scores on a midterm and final exam
**** [[https://avehtari.github.io/ROS-Examples/FakeMidtermFinal/simulation_based_design.html][simulation_based_design.html]] * Fake dataset of a randomized experiment on student grades
*** [[https://github.com/avehtari/ROS-Examples/tree/master/FrenchElection/][FrenchElection/]]
**** [[https://avehtari.github.io/ROS-Examples/FrenchElection/ps_primaire.html][ps_primaire.html]] * French Election data
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Gay/][Gay/]]
**** [[https://avehtari.github.io/ROS-Examples/Gay/gay_simple.html) * Simple models (linear and discretized age][gay_simple.html]] and political attitudes as a function of age
**** [[https://avehtari.github.io/ROS-Examples/Gay/gay.html) * Nonlinear models (Loess, B-spline, GP-spline, and BART][gay.html]] and political attitudes as a function of age
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Girls/][Girls/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Golf/][Golf/]]
**** [[https://avehtari.github.io/ROS-Examples/Golf/golf.html][golf.html]] * Gold putting accuracy: Fitting a nonlinear model using Stan
*** [[https://github.com/avehtari/ROS-Examples/HDI/][HDI/]]
**** [[https://avehtari.github.io/ROS-Examples/HDI/hdi.html][hdi.html]] * Human Development Index * Looking at data in different ways
*** [[https://github.com/avehtari/ROS-Examples/tree/master/HealthExpenditure/][HealthExpenditure/]]
**** [[https://avehtari.github.io/ROS-Examples/HealthExpenditure/healthexpenditure.html][healthexpenditure.html]] * Discovery through graphs of data and models
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Helicopters/][Helicopters/]]
**** [[https://avehtari.github.io/ROS-Examples/Helicopters/helicopters.html][helicopters.html]] * Example data file for helicopter flying time exercise
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Imputation/][Imputation/]]
**** [[https://avehtari.github.io/ROS-Examples/Imputation/imputation.html][imputation.html]] * Regression-based imputation for the Social Indicators Survey
**** [[https://avehtari.github.io/ROS-Examples/Imputation/imputation_gg.html][imputation_gg.html]] * Regression-based imputation for the Social Indicators Survey, dplyr/ggplot version
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Incentives/][Incentives/]]
**** [[https://avehtari.github.io/ROS-Examples/Incentives/incentives.html][incentives.html]] * Simple analysis of incentives data
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Influence/][Influence/]]
**** [[https://avehtari.github.io/ROS-Examples/Influence/influence.html][influence.html]] * Influence of individual points in a fitted regression
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Interactions/][Interactions/]]
**** [[https://avehtari.github.io/ROS-Examples/Interactions/interactions.html][interactions.html]] * Plot interaction example figure
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Introclass/][Introclass/]]
**** [[https://avehtari.github.io/ROS-Examples/Introclass/residual_plots.html][residual_plots.html]] * Plot residuals vs. predicted values, or residuals vs. observed values?
*** [[https://github.com/avehtari/ROS-Examples/tree/master/KidIQ/][KidIQ/]]
**** [[https://avehtari.github.io/ROS-Examples/KidIQ/kidiq.html][kidiq.html]] * Linear regression with multiple predictors
**** [[https://avehtari.github.io/ROS-Examples/KidIQ/kidiq_loo.html][kidiq_loo.html]] * Linear regression and leave-one-out cross-validation
**** [[https://avehtari.github.io/ROS-Examples/KidIQ/kidiq_R2.html][kidiq_R2.html]] * Linear regression and Bayes-R2 and LOO-R2
**** [[https://avehtari.github.io/ROS-Examples/KidIQ/kidiq_kcv.html][kidiq_kcv.html]] * Linear regression and K-fold cross-validation
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Lalonde/][Lalonde/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/LogisticPriors/][LogisticPriors/]]
**** [[https://avehtari.github.io/ROS-Examples/LogisticPriors/logistic_priors.html][logistic_priors.html]] * Effect of priors in logistic regression
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Mesquite/][Mesquite/]]
**** [[https://avehtari.github.io/ROS-Examples/Mesquite/mesquite.html][mesquite.html]] * Predicting the yields of mesquite bushes
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Metabolic/][Metabolic/]]
**** [[https://avehtari.github.io/ROS-Examples/Metabolic/metabolic.html][metabolic.html]] * How to interpret a power law or log-log regression
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Mile/][Mile/]]
**** [[https://avehtari.github.io/ROS-Examples/Mile/mile.html][mile.html]] * Trend of record times in the mile run
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Names/][Names/]]
**** [[https://avehtari.github.io/ROS-Examples/Names/names.html][names.html]] * Names * Distributions of names of American babies
**** [[https://avehtari.github.io/ROS-Examples/Names/lastletters.html][lastletters.html]] * Last letters * Distributions of last letters of names of American babies
*** [[https://github.com/avehtari/ROS-Examples/tree/master/NES/][NES/]]
**** [[https://avehtari.github.io/ROS-Examples/NES/nes_linear.html][nes_linear.html]] * Fitting the same regression to many datasets
**** [[https://avehtari.github.io/ROS-Examples/NES/nes_logistic.html][nes_logistic.html]] * Logistic regression, identifiability, and separation
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Newcomb/][Newcomb/]]
**** [[https://avehtari.github.io/ROS-Examples/Newcomb/newcomb.html][newcomb.html]] * Posterior predictive checking of Normal model for Newcomb’s speed of light data
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Parabola/][Parabola/]]
**** [[https://avehtari.github.io/ROS-Examples/Parabola/parabola.html][parabola.html]] * Demonstration of using Stan for optimization
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Peacekeeping/][Peacekeeping/]]
**** [[https://avehtari.github.io/ROS-Examples/Peacekeeping/peace.html][peace.html]] * Outcomes after civil war in countries with and without United Nations peacekeeping
*** [[https://github.com/avehtari/ROS-Examples/tree/master/PearsonLee/][PearsonLee/]]
