content/posts/Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020.md

    -  [hibbs\_coverage.html](<https://avehtari.github.io/ROS-Examples/ElectionsEconomy/hibbs%5Fcoverage.html>) \* Checking the model-fitting procedure using fake-data simulation.

<!--list-separator-->

-  [ElectricCompany/](<https://github.com/avehtari/ROS-Examples/tree/master/ElectricCompany/>)

    <!--list-separator-->

    -  [electric.html](<https://avehtari.github.io/ROS-Examples/ElectricCompany/electric.html>) \* Analysis of “Electric company” data

<!--list-separator-->

-  [FakeKCV/](<https://github.com/avehtari/ROS-Examples/tree/master/FakeKCV/>)

    <!--list-separator-->

    -  [fake\_kcv.html](<https://avehtari.github.io/ROS-Examples/FakeKCV/fake%5Fkcv.html>) \* Demonstration of KK-fold cross-validation using simulated data

<!--list-separator-->

-  [FakeMidtermFinal/](<https://github.com/avehtari/ROS-Examples/tree/master/FakeMidtermFinal/>)

    <!--list-separator-->

    -  [simulation.html](<https://avehtari.github.io/ROS-Examples/FakeMidtermFinal/simulation.html>) \* Fake dataset of 1000 students’ scores on a midterm and final exam

    <!--list-separator-->

    -  [simulation\_based\_design.html](<https://avehtari.github.io/ROS-Examples/FakeMidtermFinal/simulation%5Fbased%5Fdesign.html>) \* Fake dataset of a randomized experiment on student grades

<!--list-separator-->

-  [FrenchElection/](<https://github.com/avehtari/ROS-Examples/tree/master/FrenchElection/>)

    <!--list-separator-->

    -  [ps\_primaire.html](<https://avehtari.github.io/ROS-Examples/FrenchElection/ps%5Fprimaire.html>) \* French Election data

<!--list-separator-->

-  [Gay/](<https://github.com/avehtari/ROS-Examples/tree/master/Gay/>)

    <!--list-separator-->

    -  [gay\_simple.html](<https://avehtari.github.io/ROS-Examples/Gay/gay%5Fsimple.html>) \* Simple models (linear and discretized age) and political attitudes as a function of age

    <!--list-separator-->

    -  [gay.html](<https://avehtari.github.io/ROS-Examples/Gay/gay.html>) \* Nonlinear models (Loess, B-spline, GP-spline, and BART) and political attitudes as a function of age

<!--list-separator-->

-  [Girls/](<https://github.com/avehtari/ROS-Examples/tree/master/Girls/>)

<!--list-separator-->

-  [Golf/](<https://github.com/avehtari/ROS-Examples/tree/master/Golf/>)

    <!--list-separator-->

    -  [golf.html](<https://avehtari.github.io/ROS-Examples/Golf/golf.html>) \* Gold putting accuracy: Fitting a nonlinear model using Stan

<!--list-separator-->

-  [HDI/](<https://github.com/avehtari/ROS-Examples/HDI/>)

    <!--list-separator-->

    -  [hdi.html](<https://avehtari.github.io/ROS-Examples/HDI/hdi.html>) \* Human Development Index \* Looking at data in different ways

<!--list-separator-->

-  [HealthExpenditure/](<https://github.com/avehtari/ROS-Examples/tree/master/HealthExpenditure/>)

    <!--list-separator-->

    -  [healthexpenditure.html](<https://avehtari.github.io/ROS-Examples/HealthExpenditure/healthexpenditure.html>) \* Discovery through graphs of data and models

<!--list-separator-->

-  [Helicopters/](<https://github.com/avehtari/ROS-Examples/tree/master/Helicopters/>)

    <!--list-separator-->

    -  [helicopters.html](<https://avehtari.github.io/ROS-Examples/Helicopters/helicopters.html>) \* Example data file for helicopter flying time exercise

<!--list-separator-->

-  [Imputation/](<https://github.com/avehtari/ROS-Examples/tree/master/Imputation/>)

    <!--list-separator-->

    -  [imputation.html](<https://avehtari.github.io/ROS-Examples/Imputation/imputation.html>) \* Regression-based imputation for the Social Indicators Survey

    <!--list-separator-->

    -  [imputation\_gg.html](<https://avehtari.github.io/ROS-Examples/Imputation/imputation%5Fgg.html>) \* Regression-based imputation for the Social Indicators Survey, dplyr/ggplot version

<!--list-separator-->

-  [Incentives/](<https://github.com/avehtari/ROS-Examples/tree/master/Incentives/>)

    <!--list-separator-->

    -  [incentives.html](<https://avehtari.github.io/ROS-Examples/Incentives/incentives.html>) \* Simple analysis of incentives data

<!--list-separator-->

-  [Influence/](<https://github.com/avehtari/ROS-Examples/tree/master/Influence/>)

    <!--list-separator-->

    -  [influence.html](<https://avehtari.github.io/ROS-Examples/Influence/influence.html>) \* Influence of individual points in a fitted regression

<!--list-separator-->

-  [Interactions/](<https://github.com/avehtari/ROS-Examples/tree/master/Interactions/>)

    <!--list-separator-->

    -  [interactions.html](<https://avehtari.github.io/ROS-Examples/Interactions/interactions.html>) \* Plot interaction example figure

<!--list-separator-->

-  [Introclass/](<https://github.com/avehtari/ROS-Examples/tree/master/Introclass/>)

    <!--list-separator-->

    -  [residual\_plots.html](<https://avehtari.github.io/ROS-Examples/Introclass/residual%5Fplots.html>) \* Plot residuals vs. predicted values, or residuals vs. observed values?

<!--list-separator-->

-  [KidIQ/](<https://github.com/avehtari/ROS-Examples/tree/master/KidIQ/>)

    <!--list-separator-->

    -  [kidiq.html](<https://avehtari.github.io/ROS-Examples/KidIQ/kidiq.html>) \* Linear regression with multiple predictors

    <!--list-separator-->

    -  [kidiq\_loo.html](<https://avehtari.github.io/ROS-Examples/KidIQ/kidiq%5Floo.html>) \* Linear regression and leave-one-out cross-validation

    <!--list-separator-->

    -  [kidiq\_R2.html](<https://avehtari.github.io/ROS-Examples/KidIQ/kidiq%5FR2.html>) \* Linear regression and Bayes-R2 and LOO-R2

    <!--list-separator-->

    -  [kidiq\_kcv.html](<https://avehtari.github.io/ROS-Examples/KidIQ/kidiq%5Fkcv.html>) \* Linear regression and K-fold cross-validation

<!--list-separator-->

-  [Lalonde/](<https://github.com/avehtari/ROS-Examples/tree/master/Lalonde/>)

<!--list-separator-->

-  [LogisticPriors/](<https://github.com/avehtari/ROS-Examples/tree/master/LogisticPriors/>)

    <!--list-separator-->

    -  [logistic\_priors.html](<https://avehtari.github.io/ROS-Examples/LogisticPriors/logistic%5Fpriors.html>) \* Effect of priors in logistic regression

<!--list-separator-->

-  [Mesquite/](<https://github.com/avehtari/ROS-Examples/tree/master/Mesquite/>)

    <!--list-separator-->

    -  [mesquite.html](<https://avehtari.github.io/ROS-Examples/Mesquite/mesquite.html>) \* Predicting the yields of mesquite bushes

<!--list-separator-->

-  [Metabolic/](<https://github.com/avehtari/ROS-Examples/tree/master/Metabolic/>)

    <!--list-separator-->

    -  [metabolic.html](<https://avehtari.github.io/ROS-Examples/Metabolic/metabolic.html>) \* How to interpret a power law or log-log regression

<!--list-separator-->

-  [Mile/](<https://github.com/avehtari/ROS-Examples/tree/master/Mile/>)

    <!--list-separator-->

    -  [mile.html](<https://avehtari.github.io/ROS-Examples/Mile/mile.html>) \* Trend of record times in the mile run

<!--list-separator-->

-  [Names/](<https://github.com/avehtari/ROS-Examples/tree/master/Names/>)

    <!--list-separator-->

    -  [names.html](<https://avehtari.github.io/ROS-Examples/Names/names.html>) \* Names \* Distributions of names of American babies

    <!--list-separator-->

    -  [lastletters.html](<https://avehtari.github.io/ROS-Examples/Names/lastletters.html>) \* Last letters \* Distributions of last letters of names of American babies

<!--list-separator-->

-  [NES/](<https://github.com/avehtari/ROS-Examples/tree/master/NES/>)

    <!--list-separator-->

    -  [nes\_linear.html](<https://avehtari.github.io/ROS-Examples/NES/nes%5Flinear.html>) \* Fitting the same regression to many datasets

    <!--list-separator-->

    -  [nes\_logistic.html](<https://avehtari.github.io/ROS-Examples/NES/nes%5Flogistic.html>) \* Logistic regression, identifiability, and separation

<!--list-separator-->

-  [Newcomb/](<https://github.com/avehtari/ROS-Examples/tree/master/Newcomb/>)

    <!--list-separator-->

    -  [newcomb.html](<https://avehtari.github.io/ROS-Examples/Newcomb/newcomb.html>) \* Posterior predictive checking of Normal model for Newcomb’s speed of light data

<!--list-separator-->

-  [Parabola/](<https://github.com/avehtari/ROS-Examples/tree/master/Parabola/>)

    <!--list-separator-->

    -  [parabola.html](<https://avehtari.github.io/ROS-Examples/Parabola/parabola.html>) \* Demonstration of using Stan for optimization

<!--list-separator-->

-  [Peacekeeping/](<https://github.com/avehtari/ROS-Examples/tree/master/Peacekeeping/>)

    <!--list-separator-->

    -  [peace.html](<https://avehtari.github.io/ROS-Examples/Peacekeeping/peace.html>) \* Outcomes after civil war in countries with and without United Nations peacekeeping

<!--list-separator-->

-  [PearsonLee/](<https://github.com/avehtari/ROS-Examples/tree/master/PearsonLee/>)

    <!--list-separator-->
