org/Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020.org
**** [[https://avehtari.github.io/ROS-Examples/PearsonLee/heights.html][heights.html]] * The heredity of height. Published in 1903 by Karl Pearson and Alice Lee.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Pew/][Pew/]]
**** [[https://avehtari.github.io/ROS-Examples/Pew/pew.html][pew.html]] * Miscellaneous analyses using raw Pew data
*** [[https://github.com/avehtari/ROS-Examples/tree/master/PoissonExample/][PoissonExample/]]
**** [[https://avehtari.github.io/ROS-Examples/PoissonExample/poissonexample.html][poissonexample.html]] * Demonstrate Poisson regression with simulated data.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Pollution/][Pollution/]]
**** [[https://avehtari.github.io/ROS-Examples/Pollution/pollution.html][pollution.html]] * Pollution data.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Poststrat/][Poststrat/]]
**** [[https://avehtari.github.io/ROS-Examples/Poststrat/poststrat.html][poststrat.html]] * Poststratification after estimation
**** [[https://avehtari.github.io/ROS-Examples/Poststrat/poststrat2.html][poststrat2.html]] * Poststratification after estimation
*** [[https://github.com/avehtari/ROS-Examples/tree/master/ProbabilitySimulation/][ProbabilitySimulation/]]
**** [[https://avehtari.github.io/ROS-Examples/ProbabilitySimulation/probsim.html][probsim.html]] * Simulation of probability models
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Pyth/][Pyth/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Redistricting/][Redistricting/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Residuals/][Residuals/]]
**** [[https://avehtari.github.io/ROS-Examples/Residuals/residuals.html][residuals.html]] * Plotting the data and fitted model
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Restaurant/][Restaurant/]]
**** [[https://avehtari.github.io/ROS-Examples/Restaurant/restaurant.html][restaurant.html]] * Demonstration of using Stan for optimization
*** [[https://github.com/avehtari/ROS-Examples/tree/master/RiskyBehavior/][RiskyBehavior/]]
**** [[https://avehtari.github.io/ROS-Examples/RiskyBehavior/risky.html][risky.html]] Risky behavior data.
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Roaches/][Roaches/]]
**** [[https://avehtari.github.io/ROS-Examples/Roaches/roaches.html][roaches.html]] * Analyse the effect of integrated pest management on reducing cockroach levels in urban apartments
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Rodents/][Rodents/]]
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Rsquared/][Rsquared/]]
**** [[https://avehtari.github.io/ROS-Examples/Rsquared/rsquared.html][rsquared.html]] * Bayesian R^2
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Sesame/][Sesame/]]
**** [[https://avehtari.github.io/ROS-Examples/Sesame/sesame.html][sesame.html]] * Causal analysis of Sesame Street experiment
*** [[https://github.com/avehtari/ROS-Examples/tree/master/SexRatio/][SexRatio/]]
**** [[https://avehtari.github.io/ROS-Examples/SexRatio/sexratio.html][sexratio.html]] * Example where an informative prior makes a difference
*** [[https://github.com/avehtari/ROS-Examples/tree/master/SimpleCausal/][SimpleCausal/]]
**** [[https://avehtari.github.io/ROS-Examples/SimpleCausal/causal.html][causal.html]] * Simple graphs illustrating regression for causal inference
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Simplest/][Simplest/]]
**** [[https://avehtari.github.io/ROS-Examples/Simplest/simplest.html][simplest.html]] * Linear regression with a single predictor
**** [[https://avehtari.github.io/ROS-Examples/Simplest/simplest_lm.html][simplest_lm.html]] * Linear least squares regression with a single predictor
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Stents/][Stents/]]
**** [[https://avehtari.github.io/ROS-Examples/Stents/stents.html][stents.html]] * Stents * comparing distributions
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Storable/][Storable/]]
**** [[https://avehtari.github.io/ROS-Examples/Storable/storable.html][storable.html]] * Ordered categorical data analysis with a study from experimental economics, on the topic of ``storable votes.’’
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Student/][Student/]]
**** [[https://avehtari.github.io/ROS-Examples/Student/student.html][student.html]] * Models for regression coefficients
*** [[https://github.com/avehtari/ROS-Examples/tree/master/Unemployment/][Unemployment/]]
**** [[https://avehtari.github.io/ROS-Examples/Unemployment/unemployment.html][unemployment.html]] * Time series fit and posterior predictive model checking for unemployment series
* contents
** Part 1: Fundamentals : Review key tools and concepts in mathematics, statistics and computing
*** 1. Goals and challenges of regression : Prediction as a unifying theme in statistics and causal inference
*** 2. Measurement and adjustment : Data collection and visualization are important
*** 3. Graph a line, mathematical tools, and probability distributions
*** 4. Statistical estimation, uncertainty assessment, and problems of hypothesis testing 
*** 5. Simulate probability models and uncertainty about inferences and predictions : You don't understand your model until you can simulate from it
** Part 2: Linear regression : Build linear regression models, use them in real problems, and evaluate their assumptions and fit to data
*** 6. Distinguish descriptive and causal interpretations of regression, understanding these in historical context : Let's think deeply about regression
*** 7. Understand and work with simple linear regression with one predictor : You can't just __do__ regression you have to __understand__ regression
*** 8. Gain a conceptual understanding of least squares fitting
*** 9. Perform and understand probabilistic prediction and simple Bayesian information aggregation : Let's be clear about our uncertainty and prior knowledge
*** 10. Build, fit, and understand linear models with multiple predictors : You don't just __fit__ models, you __build__ models
*** 11. Understand the relative importance of different assumptions of regression models and be able to check models and evaluate their fit to data : Can you convince yourself to trust your model?
*** 12. Apply linear regression more effectively by transforming and combining predictors : Only fools work on the raw data scale
** Part 3: Generalized linear models : Build and work with logistic regression and generalized linear models
*** 13. Fit, understand and display logistic regression models for binary data : Modeling probabilities themselves
*** 14. Build, understand, and evaluate logistic regressions with interactions and other complexities : More advanced logistic regression
