content/posts/Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020.md

    -  [heights.html](<https://avehtari.github.io/ROS-Examples/PearsonLee/heights.html>) \* The heredity of height. Published in 1903 by Karl Pearson and Alice Lee.

<!--list-separator-->

-  [Pew/](<https://github.com/avehtari/ROS-Examples/tree/master/Pew/>)

    <!--list-separator-->

    -  [pew.html](<https://avehtari.github.io/ROS-Examples/Pew/pew.html>) \* Miscellaneous analyses using raw Pew data

<!--list-separator-->

-  [PoissonExample/](<https://github.com/avehtari/ROS-Examples/tree/master/PoissonExample/>)

    <!--list-separator-->

    -  [poissonexample.html](<https://avehtari.github.io/ROS-Examples/PoissonExample/poissonexample.html>) \* Demonstrate Poisson regression with simulated data.

<!--list-separator-->

-  [Pollution/](<https://github.com/avehtari/ROS-Examples/tree/master/Pollution/>)

    <!--list-separator-->

    -  [pollution.html](<https://avehtari.github.io/ROS-Examples/Pollution/pollution.html>) \* Pollution data.

<!--list-separator-->

-  [Poststrat/](<https://github.com/avehtari/ROS-Examples/tree/master/Poststrat/>)

    <!--list-separator-->

    -  [poststrat.html](<https://avehtari.github.io/ROS-Examples/Poststrat/poststrat.html>) \* Poststratification after estimation

    <!--list-separator-->

    -  [poststrat2.html](<https://avehtari.github.io/ROS-Examples/Poststrat/poststrat2.html>) \* Poststratification after estimation

<!--list-separator-->

-  [ProbabilitySimulation/](<https://github.com/avehtari/ROS-Examples/tree/master/ProbabilitySimulation/>)

    <!--list-separator-->

    -  [probsim.html](<https://avehtari.github.io/ROS-Examples/ProbabilitySimulation/probsim.html>) \* Simulation of probability models

<!--list-separator-->

-  [Pyth/](<https://github.com/avehtari/ROS-Examples/tree/master/Pyth/>)

<!--list-separator-->

-  [Redistricting/](<https://github.com/avehtari/ROS-Examples/tree/master/Redistricting/>)

<!--list-separator-->

-  [Residuals/](<https://github.com/avehtari/ROS-Examples/tree/master/Residuals/>)

    <!--list-separator-->

    -  [residuals.html](<https://avehtari.github.io/ROS-Examples/Residuals/residuals.html>) \* Plotting the data and fitted model

<!--list-separator-->

-  [Restaurant/](<https://github.com/avehtari/ROS-Examples/tree/master/Restaurant/>)

    <!--list-separator-->

    -  [restaurant.html](<https://avehtari.github.io/ROS-Examples/Restaurant/restaurant.html>) \* Demonstration of using Stan for optimization

<!--list-separator-->

-  [RiskyBehavior/](<https://github.com/avehtari/ROS-Examples/tree/master/RiskyBehavior/>)

    <!--list-separator-->

    -  [risky.html](<https://avehtari.github.io/ROS-Examples/RiskyBehavior/risky.html>) Risky behavior data.

<!--list-separator-->

-  [Roaches/](<https://github.com/avehtari/ROS-Examples/tree/master/Roaches/>)

    <!--list-separator-->

    -  [roaches.html](<https://avehtari.github.io/ROS-Examples/Roaches/roaches.html>) \* Analyse the effect of integrated pest management on reducing cockroach levels in urban apartments

<!--list-separator-->

-  [Rodents/](<https://github.com/avehtari/ROS-Examples/tree/master/Rodents/>)

<!--list-separator-->

-  [Rsquared/](<https://github.com/avehtari/ROS-Examples/tree/master/Rsquared/>)

    <!--list-separator-->

    -  [rsquared.html](<https://avehtari.github.io/ROS-Examples/Rsquared/rsquared.html>) \* Bayesian R^2

<!--list-separator-->

-  [Sesame/](<https://github.com/avehtari/ROS-Examples/tree/master/Sesame/>)

    <!--list-separator-->

    -  [sesame.html](<https://avehtari.github.io/ROS-Examples/Sesame/sesame.html>) \* Causal analysis of Sesame Street experiment

<!--list-separator-->

-  [SexRatio/](<https://github.com/avehtari/ROS-Examples/tree/master/SexRatio/>)

    <!--list-separator-->

    -  [sexratio.html](<https://avehtari.github.io/ROS-Examples/SexRatio/sexratio.html>) \* Example where an informative prior makes a difference

<!--list-separator-->

-  [SimpleCausal/](<https://github.com/avehtari/ROS-Examples/tree/master/SimpleCausal/>)

    <!--list-separator-->

    -  [causal.html](<https://avehtari.github.io/ROS-Examples/SimpleCausal/causal.html>) \* Simple graphs illustrating regression for causal inference

<!--list-separator-->

-  [Simplest/](<https://github.com/avehtari/ROS-Examples/tree/master/Simplest/>)

    <!--list-separator-->

    -  [simplest.html](<https://avehtari.github.io/ROS-Examples/Simplest/simplest.html>) \* Linear regression with a single predictor

    <!--list-separator-->

    -  [simplest\_lm.html](<https://avehtari.github.io/ROS-Examples/Simplest/simplest%5Flm.html>) \* Linear least squares regression with a single predictor

<!--list-separator-->

-  [Stents/](<https://github.com/avehtari/ROS-Examples/tree/master/Stents/>)

    <!--list-separator-->

    -  [stents.html](<https://avehtari.github.io/ROS-Examples/Stents/stents.html>) \* Stents \* comparing distributions

<!--list-separator-->

-  [Storable/](<https://github.com/avehtari/ROS-Examples/tree/master/Storable/>)

    <!--list-separator-->

    -  [storable.html](<https://avehtari.github.io/ROS-Examples/Storable/storable.html>) \* Ordered categorical data analysis with a study from experimental economics, on the topic of \`\`storable votes.’’

<!--list-separator-->

-  [Student/](<https://github.com/avehtari/ROS-Examples/tree/master/Student/>)

    <!--list-separator-->

    -  [student.html](<https://avehtari.github.io/ROS-Examples/Student/student.html>) \* Models for regression coefficients

<!--list-separator-->

-  [Unemployment/](<https://github.com/avehtari/ROS-Examples/tree/master/Unemployment/>)

    <!--list-separator-->

    -  [unemployment.html](<https://avehtari.github.io/ROS-Examples/Unemployment/unemployment.html>) \* Time series fit and posterior predictive model checking for unemployment series


## contents {#contents}


### Part 1: Fundamentals : Review key tools and concepts in mathematics, statistics and computing {#part-1-fundamentals-review-key-tools-and-concepts-in-mathematics-statistics-and-computing}

<!--list-separator-->

-  1. Goals and challenges of regression : Prediction as a unifying theme in statistics and causal inference

<!--list-separator-->

-  2. Measurement and adjustment : Data collection and visualization are important

<!--list-separator-->

-  3. Graph a line, mathematical tools, and probability distributions

<!--list-separator-->

-  4. Statistical estimation, uncertainty assessment, and problems of hypothesis testing

<!--list-separator-->

-  5. Simulate probability models and uncertainty about inferences and predictions : You don't understand your model until you can simulate from it


### Part 2: Linear regression : Build linear regression models, use them in real problems, and evaluate their assumptions and fit to data {#part-2-linear-regression-build-linear-regression-models-use-them-in-real-problems-and-evaluate-their-assumptions-and-fit-to-data}

<!--list-separator-->

-  6. Distinguish descriptive and causal interpretations of regression, understanding these in historical context : Let's think deeply about regression

<!--list-separator-->

-  7. Understand and work with simple linear regression with one predictor : You can't just <span class="underline"><span class="underline">do</span></span> regression you have to <span class="underline"><span class="underline">understand</span></span> regression

<!--list-separator-->

-  8. Gain a conceptual understanding of least squares fitting

<!--list-separator-->

-  9. Perform and understand probabilistic prediction and simple Bayesian information aggregation : Let's be clear about our uncertainty and prior knowledge

<!--list-separator-->

-  10. Build, fit, and understand linear models with multiple predictors : You don't just <span class="underline"><span class="underline">fit</span></span> models, you <span class="underline"><span class="underline">build</span></span> models

<!--list-separator-->

-  11. Understand the relative importance of different assumptions of regression models and be able to check models and evaluate their fit to data : Can you convince yourself to trust your model?

<!--list-separator-->

-  12. Apply linear regression more effectively by transforming and combining predictors : Only fools work on the raw data scale


### Part 3: Generalized linear models : Build and work with logistic regression and generalized linear models {#part-3-generalized-linear-models-build-and-work-with-logistic-regression-and-generalized-linear-models}

<!--list-separator-->

-  13. Fit, understand and display logistic regression models for binary data : Modeling probabilities themselves

<!--list-separator-->

-  14. Build, understand, and evaluate logistic regressions with interactions and other complexities : More advanced logistic regression

<!--list-separator-->
