content/posts/Regression_and_Other_Stories_by_Andrew_Gelman,_Jennifer_Hill,_and_Aki_Vehtari_in_2020.md

-  15. Fit, understand, and display generalized linear models, including the Poisson and negative binomial regression, ordered logistic regression, and other models : Building models from the inside out


### Part 4: Before and after fitting a regression : Design studies and use data more effectively in applied settings {#part-4-before-and-after-fitting-a-regression-design-studies-and-use-data-more-effectively-in-applied-settings}

<!--list-separator-->

-  16. Use probability theory and simulation to guide data-collection decisions, without falling into the trap of demanding unrealistic levels of certainty : To understand the past, you must first know the future

<!--list-separator-->

-  17. Use poststratification to generalize from sample to population and use regression models to impute missing data : Enough about your data. Tell me about the population.


### Part 5: Causal inference : Implement and understand basic statistical designs and analyses for causal inference {#part-5-causal-inference-implement-and-understand-basic-statistical-designs-and-analyses-for-causal-inference}

<!--list-separator-->

-  18. Understand assumptions underlying causal inference with a focus on randomized experiments : How can flipping a coin help you estimate causal effects?

<!--list-separator-->

-  19. Perform causal inference in simple settings using regressions to estimate treatment effects and interactions : Using correlation and assumptions to infer causation

<!--list-separator-->

-  20. Understand the challenges of causal inference from observational data and statistical tools for adjusting for differences between treatment and control groups : Causal inference is just a kind of prediction

<!--list-separator-->

-  21. Understand the assumptions underlying more advanced methods that use auxiliary variables or particular data structures to identify causal effects, and be able to fit these models to data : More assumptions, more problems


### Part 6: Multilevel, nonlinear, and nonparametric models : Become aware of more advanced regression models {#part-6-multilevel-nonlinear-and-nonparametric-models-become-aware-of-more-advanced-regression-models}

<!--list-separator-->

-  22. Advanced regression and multilevel models : Get a sense of the directions in which linear and generalized linear models can be extended to attack various classes of applied problems
